
## :white_check_mark: Apply Succeeded (user-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/5405)



<pre><code>Apply complete! Resources: 8 added, 0 changed, 12 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
null_resource.userapi_application_ecsservice_createtaskdefinitionfile_A46FBD11: Refreshing state... [id=6513387625170192578]
pagerduty_service_integration.userapi_pagerduty_userapipagerdutysentry9C556C5Ccritical_7D39B3F1: Refreshing state... [id=PRFB0CF]
pagerduty_service_integration.userapi_pagerduty_userapipagerdutycloudwatch89D42FD0critical_B9CD7491: Refreshing state... [id=PO6Q00S]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
pagerduty_service_integration.userapi_pagerduty_userapipagerdutycloudwatch89D42FD0noncritical_625B4CB0: Refreshing state... [id=PZ1N24V]
pagerduty_service_integration.userapi_pagerduty_userapipagerdutysentry9C556C5Cnoncritical_D4A4376C: Refreshing state... [id=PVRM1S5]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
aws_iam_role_policy.userapi_codepipeline_codepipelinerolepolicy_AEE9D93F: Refreshing state... [id=UserAPI-Prod-CodePipelineRole:UserAPI-Prod-CodePipeline-Role-Policy]
aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2: Refreshing state... [id=/ecs/UserAPI-Prod/aws-otel-collector20221214211544952300000001]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
aws_codepipeline.userapi_codepipeline_codepipeline_7ACB3975: Refreshing state... [id=UserAPI-Prod-CodePipeline]
aws_iam_role.userapi_codepipeline_codepipelinerole_6B507A92: Refreshing state... [id=UserAPI-Prod-CodePipelineRole]
aws_s3_bucket.userapi_codepipeline_codepipelinebucket_994E9F24: Refreshing state... [id=pocket-codepipeline-7a732fdb0e87f7c7e35e3b3ca999ec42]
data.terraform_remote_state.incident_management: Read complete after 1s
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/UserAPI-Prod]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_sns_topic.backend_notifications: Reading...
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/UserAPI-Prod/ecs/app]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z10149322R3CAAZXPU1G7]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=fcbf8b89-bc35-4562-b2ac-8220282ef420:UserAPI-Prod-ECS]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/0e8413f4-af99-48e5-ae9e-5eb26ae0c98c]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_kms_alias.kms_alias: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=userapi-prod-app]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=996905175585]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Critical]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_vpc.pocket-vpc_2587E211: Reading...
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PKMDQBC]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PHQSPMP]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=UserAPI-Prod-TaskExecutionRole]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=Z2BHWTOWFVNW3M]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=UserAPI-Prod-TaskRole]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/a0803719a681d372fb9d0a1961fb8a9a130b12c8]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=4052455996]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=UserAPI-Prod-ECSCodeDeployRole]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=2679175728]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=Z2BHWTOWFVNW3M_user-api.readitlater.com_NS]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=userapi-prod-app]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::996905175585:policy/UserAPI-Prod-TaskRolePolicy]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z10149322R3CAAZXPU1G7__41c2f6790a632f4e1bbe16a424c93898.user-api.readitlater.com._CNAME]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::996905175585:policy/UserAPI-Prod-TaskExecutionRolePolicy]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=UserAPI-Prod-TaskExecutionRole-20210604230839183400000008]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Critical:6c6ceed9-251f-4d47-92e7-e319cd2b0ef8]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 1s [id=vpc-867638e3]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=UserAPI-Prod]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Non-Critical:fbd7e438-6dfe-4f77-9655-1132be155f6c]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=UserAPI-Prod-TaskExecutionRole-2021060423083933750000000b]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 1s [id=vpc-867638e3]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=UserAPI-Prod-ECSCodeDeployRole-20210604230839270000000009]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2022-05-05 03:37:01.784 +0000 UTC]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=UserAPI-Prod-TaskRole-2021060423083927150000000a]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/USRAPI20210604230838285900000004/87307e89d76d93f4]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/USRAPI20210604230838670700000007/dc97dbdacd83456f]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-0e9b60116b687348a]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=6de0ee888f3677de6c49be6782baad14f0061e2c]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-0c830a5b2195c95b9]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/USRAPI2021060423083962680000000d/0c1457d8e768be1c]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/USRAPI2021060423083962680000000d/0c1457d8e768be1c/df13cc838477d8ad]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z10149322R3CAAZXPU1G7_user-api.readitlater.com_A_1]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/USRAPI2021060423083962680000000d/0c1457d8e768be1c/40d31ef737279038]
aws_cloudwatch_metric_alarm.application_alarm-httpresponsetime_9124C30A: Refreshing state... [id=UserAPI-Prod-Alarm-HTTPResponseTime]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=UserAPI-Prod-Alarm-HTTPTarget5xxErrorRate]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/USRAPI2021060423083962680000000d/0c1457d8e768be1c/40d31ef737279038/3a098a2c2cf2a9af]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/UserAPI-Prod/UserAPI-Prod]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=UserAPI-Prod]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/UserAPI-Prod/UserAPI-Prod]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=d5e49478-6790-486d-9a1b-97443d562bc1]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=UserAPI-Prod-ScaleOutPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=UserAPI-Prod-ScaleInPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=UserAPI-Prod Service High CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=UserAPI-Prod Service Low CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.userapi_application_albcertificate_7640FCAB has moved to aws_acm_certificate.application_alb_certificate_93966247
    resource "aws_acm_certificate" "application_alb_certificate_93966247" {
        id                        = "arn:aws:acm:us-east-1:996905175585:certificate/0e8413f4-af99-48e5-ae9e-5eb26ae0c98c"
        tags                      = {
            "environment" = "Prod"
            "service"     = "UserAPI"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate_validation.userapi_application_albcertificate_certificatevalidation_F8EBAD3C has moved to aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
    resource "aws_acm_certificate_validation" "application_alb_certificate_certificate_validation_25DAB195" {
        id                      = "2022-05-05 03:37:01.784 +0000 UTC"
        # (2 unchanged attributes hidden)
    }

  # aws_alb.userapi_application_applicationloadbalancer_alb_F30023FB has moved to aws_alb.application_application_load_balancer_alb_05EA9801
    resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/USRAPI2021060423083962680000000d/0c1457d8e768be1c"
        name                                        = "USRAPI2021060423083962680000000d"
        tags                                        = {
            "environment" = "Prod"
            "service"     = "UserAPI"
        }
        # (23 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # aws_alb_listener.userapi_application_listenerhttp_8A69E2A4 has moved to aws_alb_listener.application_listener_http_D74EC0ED
    resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/USRAPI2021060423083962680000000d/0c1457d8e768be1c/df13cc838477d8ad"
        tags              = {
            "environment" = "Prod"
            "service"     = "UserAPI"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb_listener.userapi_application_listenerhttps_4A4A8D11 has moved to aws_alb_listener.application_listener_https_D31CB055
    resource "aws_alb_listener" "application_listener_https_D31CB055" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/USRAPI2021060423083962680000000d/0c1457d8e768be1c/40d31ef737279038"
        tags              = {
            "environment" = "Prod"
            "service"     = "UserAPI"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_listener_rule.userapi_application_ecsservice_listenerrule_762EC502 has moved to aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
    resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/USRAPI2021060423083962680000000d/0c1457d8e768be1c/40d31ef737279038/3a098a2c2cf2a9af"
        tags         = {
            "environment" = "Prod"
            "service"     = "UserAPI"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_target_group.userapi_application_ecsservice_bluetargetgroup_ecstargetgroup_EBF37D7D has moved to aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
    resource "aws_alb_target_group" "application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/USRAPI20210604230838285900000004/87307e89d76d93f4"
        name                               = "USRAPI20210604230838285900000004"
        tags                               = {
            "environment" = "Prod"
            "service"     = "UserAPI"
            "type"        = "blue"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_alb_target_group.userapi_application_ecsservice_greentargetgroup_ecstarg

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ine-7a732f" -> null
      - bucket_regional_domain_name = "pocket-codepipeline-7a732fdb0e87f7c7e35e3b3ca999ec42.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "pocket-codepipeline-7a732fdb0e87f7c7e35e3b3ca999ec42" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "92f1efb5501a01f6ebb8e3628131c3483688d3e5ca1a7c175420c565a06a6616" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_security_group.userapi_application_applicationloadbalancer_albsecuritygroup_5E673198 has moved to aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
    resource "aws_security_group" "application_application_load_balancer_alb_security_group_7B45D070" {
        id                     = "sg-0e9b60116b687348a"
        name                   = "UserAPI-Prod-HTTP/S Security Group20210604230838397600000005"
        tags                   = {
            "Name"        = "UserAPI-Prod-HTTP/S Security Group"
            "environment" = "Prod"
            "service"     = "UserAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_security_group.userapi_application_ecsservice_ecssecuritygroup_7DD616FE has moved to aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
    resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
        id                     = "sg-0c830a5b2195c95b9"
        name                   = "UserAPI-Prod-ECSSecurityGroup2021060423083962150000000c"
        tags                   = {
            "environment" = "Prod"
            "service"     = "UserAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_sns_topic.userapi_pagerduty_alarmcriticaltopic_BAF923D0 has moved to aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
    resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Critical"
        name                                     = "UserAPI-Prod-Infrastructure-Alarm-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.userapi_pagerduty_alarmnoncriticaltopic_93FC1C3A has moved to aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
    resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Non-Critical"
        name                                     = "UserAPI-Prod-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 must be replaced
  # (moved from aws_sns_topic_subscription.userapi_pagerduty_alarmcriticalsubscription_2A3E49CE)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Critical:6c6ceed9-251f-4d47-92e7-e319cd2b0ef8" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/b6c0cf29c60d490dd09399b659d363d3/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Critical:6c6ceed9-251f-4d47-92e7-e319cd2b0ef8" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B must be replaced
  # (moved from aws_sns_topic_subscription.userapi_pagerduty_alarmnoncriticalsubscription_50A40D85)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Non-Critical:fbd7e438-6dfe-4f77-9655-1132be155f6c" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/6c59a763cd1a4b01c0efb9a6d8694b01/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Non-Critical:fbd7e438-6dfe-4f77-9655-1132be155f6c" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  # (moved from local_file.userapi_application_ecsservice_appspec_2518334F)
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

  # null_resource.userapi_application_ecsservice_createtaskdefinitionfile_A46FBD11 will be destroyed
  # (because null_resource.userapi_application_ecsservice_createtaskdefinitionfile_A46FBD11 is not in configuration)
  - resource "null_resource" "userapi_application_ecsservice_createtaskdefinitionfile_A46FBD11" {
      - id       = "6513387625170192578" -> null
      - triggers = {
          - "alwaysRun" = "2023-11-16T23:59:03Z"
        } -> null
    }

  # pagerduty_service.userapi_pagerduty_pagerdutycritical_28F47E79 has moved to pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
    resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
        id                      = "PHQSPMP"
        name                    = "UserAPI-Prod-PagerDuty-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service.userapi_pagerduty_pagerdutynoncritical_53E89260 has moved to pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
    resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
        id                      = "PKMDQBC"
        name                    = "UserAPI-Prod-PagerDuty-Non-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PHQSPMP"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PKMDQBC"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PHQSPMP"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PKMDQBC"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.userapi_pagerduty_userapipagerdutycloudwatch89D42FD0critical_B9CD7491 will be destroyed
  # (because pagerduty_service_integration.userapi_pagerduty_userapipagerdutycloudwatch89D42FD0critical_B9CD7491 is not in configuration)
  - resource "pagerduty_service_integration" "userapi_pagerduty_userapipagerdutycloudwatch89D42FD0critical_B9CD7491" {
      - html_url        = "https://mozilla.pagerduty.com/services/PHQSPMP/integrations/PO6Q00S" -> null
      - id              = "PO6Q00S" -> null
      - integration_key = "b6c0cf29c60d490dd09399b659d363d3" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PHQSPMP" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.userapi_pagerduty_userapipagerdutycloudwatch89D42FD0noncritical_625B4CB0 will be destroyed
  # (because pagerduty_service_integration.userapi_pagerduty_userapipagerdutycloudwatch89D42FD0noncritical_625B4CB0 is not in configuration)
  - resource "pagerduty_service_integration" "userapi_pagerduty_userapipagerdutycloudwatch89D42FD0noncritical_625B4CB0" {
      - html_url        = "https://mozilla.pagerduty.com/services/PKMDQBC/integrations/PZ1N24V" -> null
      - id              = "PZ1N24V" -> null
      - integration_key = "6c59a763cd1a4b01c0efb9a6d8694b01" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PKMDQBC" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.userapi_pagerduty_userapipagerdutysentry9C556C5Ccritical_7D39B3F1 will be destroyed
  # (because pagerduty_service_integration.userapi_pagerduty_userapipagerdutysentry9C556C5Ccritical_7D39B3F1 is not in configuration)
  - resource "pagerduty_service_integration" "userapi_pagerduty_userapipagerdutysentry9C556C5Ccritical_7D39B3F1" {
      - html_url        = "https://mozilla.pagerduty.com/services/PHQSPMP/integrations/PRFB0CF" -> null
      - id              = "PRFB0CF" -> null
      - integration_key = "72276480f1b24a06c02b431258affd74" -> null
      - name            = "Sentry" -> null
      - service         = "PHQSPMP" -> nullm
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.userapi_pagerduty_userapipagerdutysentry9C556C5Cnoncritical_D4A4376C will be destroyed
  # (because pagerduty_service_integration.userapi_pagerduty_userapipagerdutysentry9C556C5Cnoncritical_D4A4376C is not in configuration)
  - resource "pagerduty_service_integration" "userapi_pagerduty_userapipagerdutysentry9C556C5Cnoncritical_D4A4376C" {
      - html_url        = "https://mozilla.pagerduty.com/services/PKMDQBC/integrations/PVRM1S5" -> null
      - id              = "PVRM1S5" -> null
      - integration_key = "75127b0b6e954504c0a0758173335c9c" -> null
      - name            = "Sentry" -> null
      - service         = "PKMDQBC" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

Plan: 8 to add, 0 to change, 12 to destroy.
null_resource.userapi_application_ecsservice_createtaskdefinitionfile_A46FBD11: Destroying... [id=6513387625170192578]
pagerduty_service_integration.userapi_pagerduty_userapipagerdutysentry9C556C5Ccritical_7D39B3F1: Destroying... [id=PRFB0CF]
pagerduty_service_integration.userapi_pagerduty_userapipagerdutysentry9C556C5Cnoncritical_D4A4376C: Destroying... [id=PVRM1S5]
null_resource.userapi_application_ecsservice_createtaskdefinitionfile_A46FBD11: Destruction complete after 0s
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creating...
aws_iam_role_policy.userapi_codepipeline_codepipelinerolepolicy_AEE9D93F: Destroying... [id=UserAPI-Prod-CodePipelineRole:UserAPI-Prod-CodePipeline-Role-Policy]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destroying... [id=arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Non-Critical:fbd7e438-6dfe-4f77-9655-1132be155f6c]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destroying... [id=arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Critical:6c6ceed9-251f-4d47-92e7-e319cd2b0ef8]
aws_codepipeline.userapi_codepipeline_codepipeline_7ACB3975: Destroying... [id=UserAPI-Prod-CodePipeline]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=UserAPI-Prod]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_iam_role_policy.userapi_codepipeline_codepipelinerolepolicy_AEE9D93F: Destruction complete after 0s
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destruction complete after 0s
pagerduty_service_integration.userapi_pagerduty_userapipagerdutycloudwatch89D42FD0noncritical_625B4CB0: Destroying... [id=PZ1N24V]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creating...
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destruction complete after 0s
pagerduty_service_integration.userapi_pagerduty_userapipagerdutycloudwatch89D42FD0critical_B9CD7491: Destroying... [id=PO6Q00S]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creating...
aws_codepipeline.userapi_codepipeline_codepipeline_7ACB3975: Destruction complete after 0s
aws_s3_bucket.userapi_codepipeline_codepipelinebucket_994E9F24: Destroying... [id=pocket-codepipeline-7a732fdb0e87f7c7e35e3b3ca999ec42]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=UserAPI-Prod]
aws_iam_role.userapi_codepipeline_codepipelinerole_6B507A92: Destroying... [id=UserAPI-Prod-CodePipelineRole]
pagerduty_service_integration.userapi_pagerduty_userapipagerdutysentry9C556C5Ccritical_7D39B3F1: Destruction complete after 1s
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=2f4339a11f7f991a0ce44b8209544a03e7deb3c2]
aws_iam_role.userapi_codepipeline_codepipelinerole_6B507A92: Destruction complete after 0s
pagerduty_service_integration.userapi_pagerduty_userapipagerdutysentry9C556C5Cnoncritical_D4A4376C: Destruction complete after 1s
aws_s3_bucket.userapi_codepipeline_codepipelinebucket_994E9F24: Destruction complete after 0s
pagerduty_service_integration.userapi_pagerduty_userapipagerdutycloudwatch89D42FD0noncritical_625B4CB0: Destruction complete after 0s
pagerduty_service_integration.userapi_pagerduty_userapipagerdutycloudwatch89D42FD0critical_B9CD7491: Destruction complete after 0s
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creation complete after 1s [id=P5KNNXK]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creation complete after 1s [id=P9WYONN]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creation complete after 0s [id=P2NM9IX]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creating...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creation complete after 0s [id=PL78N5E]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creating...
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creation complete after 1s [id=arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Critical:9a25357f-0cce-4d54-81d2-4c98464acdd0]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creation complete after 2s [id=arn:aws:sns:us-east-1:996905175585:UserAPI-Prod-Infrastructure-Alarm-Non-Critical:21673a1e-5bb0-4ba2-a66f-1635e9269c8d]
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 1976, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1976:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 7 more similar warnings elsewhere)
╵

Apply complete! Resources: 8 added, 0 changed, 12 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"83a00d5d-efe4-4017-a318-2a2b7861f0c8","JobName":"user-api_infrastructure_apply_prod","PRNumber":13,"Program":"tfcmt","SHA1":"43da09fe1f1831a6391f1c8e4002555cbab70268","Target":"user-api-cdk","Vars":{}} -->